Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: རྒོད་པ་དང་། འགྱོད་པ་དང་། ཐེ་ཙོམ་གྱི་སྒྲིབ་པ་སྤངས་པར་གྱུར་ཅིག །ཚིག་དེ་སྐད་ཅེས་སྨྲས་མ་ཐག་ཏུ་གླང་པོ་ཆེ་དེ་དག་སྟེང་གི་བར་སྣང་ལ་འདི་ལྟར་མགྱོགས་པར་དོང་སྟེ། འདི་ལྟ་སྟེ་དཔེར་ན་སྐྱེས་བུ་སྟོབས་དང་ལྡན་པས་ལག་པ་བརྐྱང་བ་ལས་སྐུམ་པའམ།
en: As soon as he said those words, the elephants quickly flew up into the sky as fast as a strong man can bend his arm and straighten it.

source: བསྐུམ་པ་ལས་རྐྱོང་བ་དེ་བཞིན་དུ་དེ་ལྟར་མགྱོགས་པར་དོང་ནས། གླང་པོ་ཆེའི་གཙོ་བོ་དེ་དག་གིས་ཇི་སྐད་སྔར་སྨྲས་པའི་བྱ་བ་དག་བྱས་ནས་ཕྱིར་ལོག་སྟེ་དེའི་མདུན་དུ་འཁོད་དོ།
en: Thus those lords of elephants accomplished what they had been told to do, and then returned and stood in front of him. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྐར་མའི་ཁྱུ་མཆོག་ཤིན་ཏུ་ཡིད་དགའ་བར་གྱུར་པ་དང་། དེ་ལ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་བསྐལ་པ་སྒྲ་སྣང་ཞེས་བྱ་བ་ལ་གླིང་བཞི་པ་འདིར་སངས་རྒྱས་ཀྱི་ཞིང་སྒྲ་ཡང་དག་པར་བསྩགས་པ་ཞེས་བྱ་བ་ཞིག་འབྱུང་བར་འགྱུར་བར་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་ཆེན་པོའི་གདུགས་མངོན་པར་འཕགས་པའི་འོད་ཟེར་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱིས་བར་དུ་འགྱུར་རོ།
en: Noble son, the young brahmin Radiant Bull was overjoyed, and the Tathāgata Ratnagarbha said to him, ‘Noble son, in the future, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, in the eon named Rutaprabhāsa, in these four continents there will be a buddha realm called Rutasañcaya, where you will be the tathāgata, and so on, up to and including the buddha bhagavat, named Ratnacchatrābhyudgataraśmi.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྐར་མའི་ཁྱུ་མཆོག་གིས། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་གཏུགས་པ་དང་། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། རྡུལ་དང་རྣམ་བྲལ་སེམས་ཅན་རྣམ་དག་ལོངས།
en: Then, noble son, the bodhisattva Radiant Bull bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, and the Tathāgata Ratnagarbha said: “ ‘Rise up, pure being, you who are free of impurity.

source: །ཁྱོད་ཀྱིས་སེམས་ཅན་བྱེ་མང་ལུང་བསྟན་ཏོ།
en: You have been prophesied for many millions of beings.

source: །བྱང་ཆུབ་ཕྱིར་ནི་རབ་དག་ལམ་སྦྱོང་ཞིང་། །རྒྱལ་མཆོག་སེམས་ཅན་རྣམས་ཀྱི་འདྲེན་པར་འགྱུར། །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: You will practice the perfectly pure path for enlightenment, And you will become a perfect jina, a guide of beings.’ “

source: བྲམ་ཟེའི་ཁྱེའུ་སྟོང་དང་། བྲམ་ཟེའི་ཁྱེའུ་བྱེ་བ་ཕྲག་གསུམ་པོ་གང་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སྨོན་ལམ་བཏབ་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་ལུང་བསྟན་ཏེ།
en: In the same way, a thousand young Veda-reciting brahmins and thirty million other young brahmins prayed to attain the highest, most complete enlightenment in this buddha realm, and the Tathāgata Ratnagarbha gave a prophecy to each of them.

source: ཐ་མ་ནི་སངས་རྒྱས་རྣམ་པར་གཟིགས་དང་། གཙུག་ཏོར་ཅན་དང་།
en: The last of these were the buddhas Vipaśyin, Śikhin, and Viśvabhu. “

source: ཐམས་ཅད་སྐྱོབ་ཀྱི་བར་དག་ཏུ་འགྱུར་རོ། །བྲམ་ཟེའི་ཁྱེའུ་ལུང་བསྟན་པ་དེ་དག་ཐམས་ཅད་ལས་གང་དག་རིག་བྱེད་ཀློག་པའི་བྲམ་ཟེ་སྟོང་ཞིག་ཡོད་པའི་ཐུ་བོ་མང་པོས་བླ་མར་བཀུར་བ་ཁྱབ་འཇུག་རླུང་ཞེས་བྱ་བ་དེས་གསོལ་པ།
en: Among the young brahmins who had received prophecies, the eldest of the thousand Veda-reciting brahmins, who was honored by many as a guru, was named Vāyuviṣṇu.

source: བདག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རེག་པར་གྱུར་ཅིག །
en: He prayed, ‘May I reach the highest, most complete enlightenment in a buddha realm that has the five degeneracies.

source: འདོད་ཆགས་བདོ་བ་དང་། ཞེ་སྡང་བདོ་བ་དང་། གཏི་མུག་བདོ་བའི་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པར་གྱུར་ཅིག །
en: May I teach the Dharma to beings who have strong desire, strong anger, and strong ignorance.’ “

source: བྲམ་ཟེའི་ཁྱེའུ་སྐར་མ་སྐྱོང་ཞེས་བྱ་བ་དེས་སྨྲས་པ། ཀྱེ་མཁན་པོ་ཁྱབ་འཇུག་རླུང་འདིས་དོན་གྱི་དབང་ཇི་ཞིག་མཐོང་ན་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་སྨོན་ལམ་འདེབས་པར་བགྱིད་ལགས།
en: The young brahmin Jyotipāla asked, ‘Oh, what purpose does the upādhyāya Vāyuviṣṇu see in praying for a buddha realm that has the five degeneracies?’

source: མདུན་ན་འདོན་གྱིས་སྨྲས་པ། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡིན་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་བྱང་ཆུབ་ཐོབ་པར་བྱེད་ཅིང་།
en: The royal priest answered, ‘A bodhisattva who has great compassion attains enlightenment in a buddha realm that has the five degeneracies.

source: སེམས་ཅན་སྐྱབས་མེད་པ་རྣམས་དང་། དཔུང་གཉེན་མེད་པ་རྣམས་དང་། ཉོན་མོངས་པ་དག་གིས་གཙེས་པ་རྣམས་དང་། ལྟ་བས་ཉོན་མོངས་པར་གྱུར་པ་རྣམས་ཀྱི་དོན་བྱེད་ཅིང་སྐྱབས་དང་དཔུང་གཉེན་དུ་འགྱུར་བ་དང་།
en: He benefits beings who have no refuge, beings who have no helper, beings who are oppressed by the kleśas, and beings who encounter calamity because of their views.

source: སེམས་ཅན་རྣམས་སྐྱེ་བའི་རྒྱ་མཚོ་ལས་སྒྲོལ་བར་བྱེད་པ་དང་། ཡང་དག་པའི་ལྟ་བ་ལ་རབ་ཏུ་འགོད་པར་བྱེད་ཅིང་སེམས་ཅན་རྣམས་མྱ་ངན་ལས་འདས་པའི་བདུད་རྩིའི་རོས་ཚིམ་པར་བྱེད་དོ་ཞེས་གྲག་སྟེ།
en: He becomes their refuge and helper—he frees beings from the ocean of birth, he establishes them in correct views, and he satisfies them with the taste of the nectar of nirvāṇa.

source: གང་གི་ཕྱིར་སངས་རྒྱས་ཀྱི་ཞིང་སྙིགས་མ་ལྔ་དང་ལྡན་པར་སྨོན་ལམ་འདེབས་པར་བྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོ་ཡིན་པར་སྣང་ངོ་། །དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ།
en: The one who prays for a buddha realm that has the five degeneracies is thus seen to be a bodhisattva with great compassion.’ “

source: ཁྱབ་འཇུག་རླུང་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་གི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་འདས་པ་དེ་ན་འཇིག་རྟེན་གྱི་ཁམས་ངུར་སྨྲིག་གི་རྒྱལ་མཚན་ཞེས་བྱ་བ་ཞིག་ཡོད་དེ།
en: The Tathāgata Ratnagarbha said, ‘Vāyuviṣṇu, in the future, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, there will be in the eastern direction, beyond as many buddha realms as there are particles in a buddha realm, a realm called Kaṣāyadhvaja.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: There, worthy being, you will attain the complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་རི་དབང་རྒྱལ་པོ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: You will be the tathāgata, and so on, up to and including the bhagavat buddha, named Śālendrarāja.’ “

source: །ཁྱབ་འཇུག་རླུང་གིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་རེ་བ་འདི་ལྟ་བུ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལྟ་ན། དེའི་སླད་དུ་གང་གི་ཚེ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་འཚལ་བ་དེའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱིས་ཞབས་བསོད་ནམས་བརྒྱའི་མཚན་གྱིས་བརྒྱན་པ་གཉིས་བདག་གི་སྤྱི་བོར་འཇོག་པར་གྱུར་ཅིག །
en: Vāyuviṣṇu said, ‘Bhadanta Bhagavat, if this wish of mine is to be completely fulfilled, when I bow down the five points of my body to the feet of the Bhagavat, may the Bhagavat’s feet, adorned by a hundred signs of merit, be placed upon the crown of my head.’ “

source: རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྲམ་ཟེ་ཁྱབ་འཇུག་རླུང་གིས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་གཏུགས་པ་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའ་ཁྱབ་འཇུག་རླུང་གི་སྤྱི་བོར་ཞབས་གཉིས་བཞག་སྟེ་བཀའ་སྩལ་པ། སྙིང་རྗེའི་བསམ་པ་ཤེས་རབ་རྣོན་པོ་ལོངས།
en: Noble son, when the brahmin Vāyuviṣṇu’s head touched the Bhagavat’s feet, the Tathāgata Ratnagarbha placed his two feet upon the crown of the bodhisattva Vāyuviṣṇu’s head and said: “ ‘Rise up, you who have thoughts of compassion and sharp wisdom.

source: །བྱང་ཆུབ་མཆོག་ཕྱིར་སྤྱད་པ་སྤྱོད་གྱིས་ལ། །བརྟན་པ་ཉོན་མོངས་འཆིང་བ་དམ་ཆོད་ཅིག །ཁྱོད་ནི་ཕན་པས་སྙིང་བརྩེ་སངས་རྒྱས་འགྱུར།
en: Practice the correct conduct for enlightenment, Cut through the strong bondage of the kleśas, And you will be a buddha who benefits through compassion.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་སྐར་མ་སྐྱོང་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་བགྱི་སྟེ།
en: Then, noble son, the young brahmin Jyotipāla knelt on his right knee before the Tathāgata Ratnagarbha and said, ‘Bhadanta Bhagavat, I too will develop the aspiration for the highest, most complete enlightenment.

source: སངས་རྒྱས་ཀྱི་ཞིང་འདིར་སེམས་ཅན་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་སེམས་ཆ་མཉམ་པ་རྣམས་དང་། དགེ་བ་དང་མི་དགེ་བའི་བསམ་པ་ལ་མི་གནས་པའི་སྐྱེ་དགུ་ཚེ་ལོ་བཞི་ཁྲི་ཐུབ་པ་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: May I attain the complete enlightenment of perfect buddhahood in this buddha realm at a time when beings have an equal amount of desire, anger, and ignorance, have minds that are not set on either the good or bad, and live for forty thousand years.’ “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་གཉིས་པ་ལ་བབ་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་འདི་ནི་མི་མཇེད་ཅེས་བྱ་བར་འགྱུར་ཏེ།
en: The Tathāgata Ratnagarbha said, ‘After an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, this world realm will be called Sahā.

source: ཅིའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་མི་མཇེད་ཅེས་བྱ་ཞེ་ན།
en: Why will this world realm be called Sahā?

source: སེམས་ཅན་དེ་དག་འདོད་ཆགས་ལ་མི་མཇེད་པ་དང་། དེ་དག་ཞེ་སྡང་ལ་མི་མཇེད་པ་དང་། གཏི་མུག་ལ་མི་མཇེད་པ་དང་།
en: It is because its inhabitants will have to endure desire, they will have to endure anger, they will have to endure ignorance, they will have to endure the bondage of the kleśas.

source: ཉོན་མོངས་པའི་འཆིང་བ་རྣམས་ལ་མི་མཇེད་པས་དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ནི་མི་མཇེད་ཅེས་བྱའོ།
en: That is why this world realm will be called Sahā.

source: །འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དེར་བསྐལ་པ་ཆེན་པོ་བཟང་པོ་ཞེས་བྱ་བ་འབྱུང་བར་འགྱུར་ཏེ།
en: In the world realm called Sahā there will be a great eon called Bhadra.

source: ཅིའི་ཕྱིར་བཟང་པོ་ཞེས་བྱ་ཞེ་ན།
en: Why is it called Bhadra?

source: བསྐལ་པ་ཆེན་པོ་བཟང་པོ་དེ་ལ་སེམས་ཅན་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྤྱོད་པ་རྣམས་ཀྱི་ནང་དུ་རྫོགས་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐུགས་རྗེ་ཆེན་པོ་དང་ལྡན་པ་སྟོང་འབྱུང་བར་འགྱུར་བའི་ཕྱིར་ཏེ།
en: Because in the great Bhadraka eon a thousand bhagavat samyaksam­buddhas with great compassion will appear among the beings who act through desire, anger, and ignorance.

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱང་བསྐལ་པ་ཆེན་པོ་བཟང་པོ་བྱུང་ཞིང་། སྐྱེ་དགུ་ལོ་བཞི་ཁྲི་ཐུབ་པ་ན་ཐམས་ཅད་ཀྱི་དང་པོར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: Worthy being, when the great Bhadraka eon has come and beings live for forty thousand years, you will be the first of all those who will attain the complete enlightenment of perfect buddhahood.

source: དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་ཅེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་ཞིང་།
en: You will be the tathāgata, and so on, up to and including the bhagavat buddha, named Krakucchanda.

source: ཐེག་པ་གསུམ་པོ་དག་གིས་ཆོས་སྟོན་པར་འགྱུར་ཏེ། འཁོར་བའི་ཆུ་བོས་བདས་པའི་སེམས་ཅན་བགྲང་བ་ལས་འདས་པ་དག་ཀྱང་སྒྲོལ་བར་འགྱུར་ཞིང་མྱ་ངན་ལས་འདས་པའི་ཕ་རོལ་ཏུ་འགོད་པར་ཡང་འགྱུར་རོ།
en: You will teach the Dharma through the three yānas, you will liberate countless beings who are being swept away by the river of saṃsāra, and you will bring them to the far shore of nirvāṇa.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྐར་མ་སྐྱོང་གིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་མགོ་བོས་ཕྱག་བྱས་ནས་ལངས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Noble son, the bodhisattva Jyotipāla then bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha, stood up, and sat to one side. “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་གཉིས་པ་ཏམ་བུ་རུ་ཞེས་བྱ་བ་ཡང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་འདུག་སྟེ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཀྱང་དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་གི་རྗེས་སུ་མཚམས་སྦྱོར་ཞིང་འཇིག་རྟེན་གྱི་སྐྱེ་དགུ་ཚེ་ལོ་སུམ་ཁྲི་ཐུབ་པ་ན་སངས་རྒྱས་སུ་འབྱུང་བར་གྱུར་ཅིག །
en: Noble son, then the second young brahmin, Tumburu, sat before the Tathāgata Ratnagarbha and said, ‘Bhadanta Bhagavat, may I become a buddha after the Tathāgata Krakucchanda, at a time when the beings in that world can live for thirty thousand years.’ “

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བཀའ་སྩལ་པ། བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་ནི་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་སངས་རྒྱས་ཀྱི་ཞིང་མི་མཇེད་དུ་བསྐལ་པ་བཟང་པོ་བྱུང་བའི་ཚེ། དེ་བཞིན་གཤེགས་པ་འཁོར་བ་འཇིག་གི་རྗེས་སུ་མཚམས་སྦྱོར་ཞིང་སྐྱེ་དགུའི་ཚེ་ལོ་སུམ་ཁྲི་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་ཐུབ་ཅེས་བྱ་བར་འགྱུར་ཏེ། འཇིག་རྟེན་དུ་སྒྲ་རྣམ་པར་གྲགས་པར་འགྱུར་རོ།
en: The Tathāgata Ratnagarbha said, ‘Young brahmin, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, in the buddha realm called Sahā, when the Bhadraka eon has come, following after the Tathāgata Krakucchanda, at a time when beings can live for thirty thousand years, you will be the tathāgata, and so on, up to and including the bhagavat buddha, named Kanakamuni, renowned throughout the world.’ “

source: །དེས་བཅོམ་ལྡན་འདས་ལས་ལུང་བསྟན་པ་ཐོས་ནས། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བསྐོར་བ་བྱས་ནས། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་འདུག་སྟེ།
en: When the brahmin Tumburu heard the Bhagavat’s prophecy, he bowed down his head to the feet of the Tathāgata Ratnagarbha, circumambulated him, and stood before the Tathāgata Ratnagarbha.

source: མེ་ཏོག་དག་གིས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་འཐོར་ཞིང་ཐལ་མོ་སྦྱར་ནས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་དག་གིས་མངོན་པར་བསྟོད་པ། ཤིན་ཏུ་འབྲེལ་བ་ལེགས་བསྒྲགས་རབ་སྙན་གསུང་བ་པོ། །མ་འཁྲུལ་མ་འདྲེས་མ་རྙོགས་དྲི་མ་མི་མངའ་བ། །ཁྱད་འཕགས་ཤིན་ཏུ་སྡོམ་བརྩོན་བློ་རབ་བློ་གྲོས་ལྡན། །དྲང་སྲོང་དམ་པ་ཁྱོད་མཛེས་ཐུབ་གཙོ་ཁྱུ་མཆོག་ལགས།
en: He scattered flowers over the Bhagavat, and with his palms together he praised the Bhagavat with verses: “ ‘You whose speech is articulate, elegant, and mellifluous; You who are unmistaken, unconfused, unpolluted, and unstained; You who are superior, the complete renunciant, perfectly intelligent, and wise, Sublime ṛṣi, you are beautiful, the chief sage, and the principal authority. “ ‘

source: །ཡོན་ཏན་བརྒྱས་བལྟམ་ཡོན་ཏན་མང་པོ་སྩོལ་བ་ཁྱོད། །ཐུབ་མཆོག་བདེ་བ་མཛད་པ་མི་ཡི་དམ་པས་བཏུད།
en: You are filled with hundreds of qualities and bestow many qualities; Supreme sage, bringer of happiness, the highest of humans bow down to you.

source: །སྲིད་པ་གསུམ་ན་ཁྱོད་འདྲའི་སེམས་ཅན་གཞན་མ་མཆིས། །དེང་ཁྱོད་སེམས་ཅན་མང་པོ་བྱང་ཆུབ་ལམ་ལུང་བསྟན།
en: There is no other being who is your equal in the three existences, And today you have prophesied the path to enlightenment for many beings.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་ཀུན་གྱིས་བསྲུངས་ཞེས་བྱ་བས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཁྲིའུ་བཞག་སྟེ། རིན་ཐང་འབུམ་གྱི་བཤམ་པས་བཤམས་ནས་ཁྲིའུ་དེ་ལ་གསེར་གྱི་ལྷུང་བཟེད་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་བ་དང་། གསེར་གྱི་རིལ་བ་བྷྲིང་ག་ར་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་སྡོང་དག་བཞག་སྟེ། སངས་རྒྱས་ལ་སོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ལ་ཕུལ་ནས་དེས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཀྱང་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མ་མཆིས་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མ་མཆིས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་གཉིས་པ་ལ་བབ་པ་ན་བསྐལ་པ་བཟང་པོ་དེ་ལ་ཚེ་འགྲིབ་པ་དང་། རྩོད་པའི་དུས་ཀྱི་མཚན་མ་བྱུང་བ་དང་། སེམས་ཅན་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་བདོ་ཞིང་། ང་རྒྱལ་དང་། ཕྲག་དོག་དང་། སེར་སྣས་ཀུན་ནས་དཀྲིས་པ་རྣམས་དང་། སེམས་ཅན་ལོག་པར་ལྟ་བ་དང་། མི་དགེ་བའི་བཤེས་གཉེན་ལ་རྟེན་པ་དང་། མི་དགེ་བའི་རྩ་བའི་སེམས་ཀུན་ནས་ལངས་པ་དང་། དགེ་བའི་རྩ་བའི་སེམས་ཡོངས་སུ་ཉམས་པ་དང་།
en: Noble son, the young brahmin Viśvagupta then set a seat made of the seven jewels before the Tathāgata Ratnagarbha, an arranged seat that had the value of a hundred thousand silver coins, and on that seat he placed a golden mendicant’s bowl filled with the seven jewels, a gold vase, and a staff made of the seven jewels.

source: ཡང་དག་པའི་ལྟ་བའི་སེམས་རྣམ་པར་སྤངས་པ་དང་། ལོག་པས་འཚོ་ཞིང་མི་དགེ་བའི་སེམས་དང་ལྡན་པ་རྣམས་ཀྱི་ནང་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པར་འགྱུར་ཞིང་། དེ་བཞིན་གཤེགས་པ་གསེར་ཐུབ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཏེ། དམ་པའི་ཆོས་ནུབ་ནས་འཇིག་རྟེན་ལོང་བར་གྱུར་ཅིང་། འདྲེན་པ་མ་མཆིས་པ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་གྱུར་ཅིག །
en: He presented this to the Buddha and the saṅgha of bhikṣus and said, ‘Bhadanta Bhagavat, in the future, after as many incalculable eons as there are grains of sand in the Ganges River have passed, during a second series of as many incalculable eons as there are grains of sand in the Ganges River, during the Bhadraka eon, when the lifespan is diminishing, when the signs of the kaliyuga have appeared, and when beings have strong desire, anger, and ignorance and are completely overcome by pride, envy, and greed; when beings have wrong views, rely on bad friends, have minds completely overcome by roots of nonvirtue, have minds completely bereft of roots of virtue, have minds lacking the correct view, and have unvirtuous minds through incorrect livelihoods; and when the Tathāgata Kanakamuni has passed into parinirvāṇa, and his Dharma has ceased to exist, and the world has become blind, and there is no guide, and beings live for twenty thousand years— then at that time may I attain the complete enlightenment of perfect buddhahood and appear among those beings as a tathāgata arhat samyaksam­buddha, perfectly endowed with wisdom and virtuous conduct.’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བྲམ་ཟེ་ཀུན་གྱིས་བསྲུངས་ལ་བཀའ་སྩལ་པ། བྲམ་ཟེ་ལེགས་སོ་ལེགས་སོ།
en: Noble son, the Tathāgata Ratnagarbha said to the brahmin Viśvagupta, ‘Excellent, brahmin, excellent!

source: །སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་རྩོད་པའི་དུས་ཀྱི་མཚན་མ་བྱུང་ཞིང་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པའི་བར་དང་།
en: Worthy being, you have prayed to become a buddha when the signs of the kaliyuga have appeared, when beings live for twenty thousand years, and when the world has become blind and has no guide.

source: འཇིག་རྟེན་ལོང་བར་གྱུར་ཅིང་འདྲེན་པ་མེད་པའི་ནང་དུ་སྨོན་ལམ་བཏབ་པ་ནི་རྟོགས་པ་ཆེ་ཞིང་ཡེ་ཤེས་དང་ལྡན་པ་ཡིན་པས་རིགས་ཀྱི་བུ་དེའི་ཕྱིར་ཁྱོད་མཁས་མཛོད་སྙིང་རྗེ་རྟེན་ཅེས་བྱ་བར་གྱུར་ཅིག །
en: This means that you have great realization and that you are endowed with wisdom. Therefore, noble son, you should have the name Vidvagañjakaruṇāśraya.

source: མཁས་མཛོད་སྙིང་རྗེ་རྟེན་ཁྱོད་ནི་མ་འོངས་པའི་དུས་ན་བསྐལ་པ་གྲངས་མེད་པ་གང་གཱའི་ཀླུང་གཅིག་གི་བྱེ་མ་སྙེད་འདས་ནས་བསྐལ་པ་གྲངས་མེད་པ་གཉིས་པ་ལ་བབ་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་མི་མཇེད་དུ་བསྐལ་པ་བཟང་པོ་བྱུང་ཞིང་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་འགྱུར་རོ།
en: Vidvagañjakaruṇāśraya, in the future, after an incalculable eon has passed, in which there are as many years as there are grains of sand in the Ganges River, during a second such incalculable eon, in which there are as many years as there are grains of sand in the Ganges River, in the Sahā realm, when the Bhadraka eon has come, when beings live for twenty thousand years, you will be the tathāgata, and so on, up to and including the bhagavat buddha, named Kāśyapa.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཁས་མཛོད་སྙིང་རྗེ་རྟེན་གྱིས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་མེ་ཏོག་དང་། མེ་ཏོག་ཕྲེང་དང་། སྤོས་དང་།
en: Then, noble son, the bodhisattva Vidvagañjakaruṇāśraya bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha and stood to one side.

source: ཕྱེ་མ་དག་གིས་གཏོར་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །མི་མཆོག་ཕན་པ་མཛད་པ་དགའ་བར་བགྱིད་པ་སྐྱེད་པ་པོ། །ཞལ་འཛུམ་རབ་ཏུ་དགྱེས་པ་ཤིན་ཏུ་སྙན་པའི་གསུང་མངའ་བ། །གནས་མཁྱེན་མཁས་པ་ཕན་པ་མཛད་པ་སྟོབས་བཅུ་རབ་མཆོག་ལྡན། །ཡེ་ཤེས་བསམ་གཏན་རྣམ་པར་མཐར་ཕྱིན་བདེ་གཤེགས་ཁྱོད་ལ་འདུད།
en: He scattered flowers, flower garlands, incense, and powders over the Tathāgata Ratnagarbha and praised him with these verses: “ ‘Supreme human, the one who benefits, the one who brings joy, With a smiling face, with joyful, delightful speech, Proficient in the knowledge of all subjects, most excellent benefactor possessing the ten strengths, Perfected in wisdom, meditation, and liberation—I pay homage to you, Sugata. “ ‘

source: །སྤྱོད་པ་མང་པོ་སྤྱད་པ་ཞལ་ནི་རྣམ་རྒྱས་པ། །ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་ཕྲག་མང་པོ། །གཞལ་ཡས་བྱང་ཆུབ་སླད་དུ་ལུང་ཡང་བསྟན་པ་མཛད། །མི་མཆོག་བདེ་བར་གཤེགས་པ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ།
en: With a mature face from having carried out many practices, You have given prophecies of incomparable enlightenment To many myriads of bodhisattvas— I pay homage to you, supreme human, Sugata.’ “

source: །རིགས་ཀྱི་བུ། དེ་ནས་བྲམ་ཟེ་རྒྱ་མཚོའི་རྡུལ་གྱིས་བྲམ་ཟེའི་ཁྱེའུ་བཞི་པ་བགྲོད་བྱའི་བུ་དྲི་མ་མེད་ཅེས་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་ཏོ།
en: Then, noble son, the brahmin Samudrareṇu encouraged the fourth young brahmin, Vimalavaiśāyana.

source: །རིགས་ཀྱི་བུ་དེ་ནས་བྲམ་ཟེའི་ཁྱེའུ་བགྲོད་བྱའི་བུ་དྲི་མ་མེད་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་འདུག་སྟེ་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཀྱང་དེ་བཞིན་དུ་བསྐལ་པ་བཟང་པོ་དེ་ལ་བྱང་ཆུབ་པར་འཚལ་མོད་ཀྱི་རྩོད་པའི་དུས་དེ་ལྟ་བུ་འབའ་ཞིག་མི་འཚལ་ཏེ། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་སྐྱེ་དགུ་ཚེ་ལོ་ཁྲི་ཐུབ་པ་ན་སེམས་ཅན་སྦྱིན་པ་དང་། དུལ་བ་དང་། ཡང་དག་པར་སྡོམ་པའི་བསམ་པ་བས་པ་རྣམས་དང་། ནོར་བདུན་དང་བྲལ་བ་རྣམས་དང་། མི་དགེ་བའི་བཤེས་གཉེན་ལ་སྟོན་པར་འདུ་ཤེས་པར་སེམས་པ་ལ་ཞུགས་པ་རྣམས་དང་།
en: Noble son, the young brahmin Vimalavaiśāyana then stood in front of the Tathāgata Ratnagarbha and said, ‘Bhadanta Bhagavat, I also aspire to enlightenment in the Bhadraka eon—only not in the kaliyuga. “ ‘

source: བསོད་ནམས་བྱ་བའི་དངོས་པོ་གསུམ་པོ་དག་དོན་དུ་མི་གཉེར་བ་རྣམས་དང་། ལེགས་པར་སྤྱོད་པ་གསུམ་དང་བྲལ་བ་རྣམས་དང་། ཉེས་པར་སྤྱོད་པ་གསུམ་པོ་དག་ལ་བརྩོན་པ་རྣམས་དང་། ཉོན་མོངས་པའི་མུན་པས་སེམས་རྣམ་པར་དཀྲུགས་པ་རྣམས་དང་། ཐེག་པ་གསུམ་པོ་དག་དོན་དུ་མི་གཉེར་བ་དེའི་དུས་སུ་ནི་སུས་ཀྱང་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་བསྒྲུབ་པར་རྔོ་མི་ཐོགས་ལགས་ན།
en: When the Tathāgata Kāśyapa has passed into parinirvāṇa, when the lifespan of people is ten thousand years, when beings no longer have thoughts of generosity, control, or vows, when they are devoid of the seven riches, when they perceive bad friends as teachers, when they are not interested in engaging in the three acts that create merit, when they are devoid of the three good types of conduct, when they are dedicated to the three pleasures, when they have minds disturbed by the darkness of the kleśas, when they are not interested in the three yānas—at that time, no one is able to bring about the conduct of a bodhisattva.

source: སྐྱེ་དགུ་ཚེ་ལོ་སྟོང་ཐུབ་པ་ན་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་ཏེ། སེམས་ཅན་དེ་དག་ཀྱང་ཚེ་ལོ་བརྒྱ་པའི་བར་དུ་འགྱུར་ཏེ། དེའི་དུས་ན་ནི་སེམས་ཅན་རྣམས་ལ་དགེ་བའི་རྩ་བ་མིང་ཡང་མ་མཆིས་ན་དགེ་བའི་རྩ་བ་སྤྱོད་པ་རྣམས་ཀྱང་ཅི་འཚལ།
en: What to say when the lifespan is a thousand years, and then when those beings have a lifespan of only a hundred years—at that time, beings will not even know the words root of merit, let alone the practice of roots of virtue.

source: རེ་ཞིག་སྙིགས་མ་ལྔ་དང་ལྡན་པའི་འཇིག་རྟེན་ཚེ་འབྲི་ཞིང་ལོ་བརྒྱ་པར་གྱུར་ནས། མཚོན་གྱི་བསྐལ་པ་བར་མ་ཉེ་བར་གནས་པར་གྱུར་པ་དེའི་དུས་ན་བདག་ལྷ་རྣམས་ཀྱི་ནང་ནས་བབས་ཤིང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྐྱོབ་པར་གྱུར་ཅིག །
en: At that time, when the world is comprised of the five degeneracies, when the lifespan is diminishing to a hundred years, when the intermediate eon of weapons has set in, may I descend from the gods and bring protection to beings.

source: མི་དགེ་བ་སྤངས་ནས་དགེ་བ་ལ་སྤྱོད་པར་གྱུར་ཅིག །
en: May I enjoin them to good actions, having abandoned bad actions.
